; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-4-6-202)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p4-0 - location
	p5-1 - location
	p5-4 - location
	p1-0 - location
	p2-0 - location
	p2-1 - location
	p2-4 - location
	p6-0 - location
	p3-0 - location
	p3-6 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s0)
	(at driver3 s6)
	(at driver4 s1)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s5)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s3)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s3)
	(at package2 s3)
	(at package3 s6)
	(at package4 s6)
	(at package5 s2)
	(at package6 s3)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 10)
	(= (time-to-walk p4-0 s4) 10)
	(= (time-to-walk s0 p4-0) 32)
	(= (time-to-walk p4-0 s0) 32)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 28)
	(= (time-to-walk p5-1 s5) 28)
	(= (time-to-walk s1 p5-1) 41)
	(= (time-to-walk p5-1 s1) 41)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 24)
	(= (time-to-walk p5-4 s5) 24)
	(= (time-to-walk s4 p5-4) 20)
	(= (time-to-walk p5-4 s4) 20)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 29)
	(= (time-to-walk p1-0 s1) 29)
	(= (time-to-walk s0 p1-0) 14)
	(= (time-to-walk p1-0 s0) 14)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 51)
	(= (time-to-walk p2-0 s2) 51)
	(= (time-to-walk s0 p2-0) 34)
	(= (time-to-walk p2-0 s0) 34)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 16)
	(= (time-to-walk p2-1 s2) 16)
	(= (time-to-walk s1 p2-1) 26)
	(= (time-to-walk p2-1 s1) 26)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 44)
	(= (time-to-walk p2-4 s2) 44)
	(= (time-to-walk s4 p2-4) 50)
	(= (time-to-walk p2-4 s4) 50)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 37)
	(= (time-to-walk p6-0 s6) 37)
	(= (time-to-walk s0 p6-0) 46)
	(= (time-to-walk p6-0 s0) 46)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 42)
	(= (time-to-walk p3-0 s3) 42)
	(= (time-to-walk s0 p3-0) 20)
	(= (time-to-walk p3-0 s0) 20)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 22)
	(= (time-to-walk p3-6 s3) 22)
	(= (time-to-walk s6 p3-6) 25)
	(= (time-to-walk p3-6 s6) 25)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 3)
	(= (time-to-drive s0 s6) 3)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 31)
	(= (time-to-drive s1 s6) 31)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 29)
	(= (time-to-drive s2 s6) 29)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 41)
	(= (time-to-drive s0 s4) 41)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 18)
	(= (time-to-drive s1 s4) 18)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 51)
	(= (time-to-drive s6 s4) 51)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 39)
	(= (time-to-drive s0 s5) 39)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 31)
	(= (time-to-drive s0 s2) 31)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 12)
	(= (time-to-drive s1 s2) 12)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 49)
	(= (time-to-drive s5 s2) 49)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 36)
	(= (time-to-drive s2 s3) 36)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 33)
	(= (time-to-drive s4 s3) 33)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 11)
	(= (time-to-drive s5 s3) 11)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 11)
	(= (time-to-drive s3 s0) 11)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 11)
	(= (time-to-drive s3 s1) 11)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s0)
	(at driver4 s4)
	(at truck2 s5)
	(at truck3 s1)
	(at package1 s4)
	(at package2 s0)
	(at package3 s4)
	(at package4 s4)
	(at package5 s6)
	(at package6 s2)
	))

(:metric minimize (+ (* 4 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver4 truck1 s1)
   deleted: (at driver4 s1) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 1 of 10
2. (drive-truck truck1 s1 s3 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (fuel-used) from 0 to 110
   goals met: 1 of 10
3. (load-truck package1 truck1 s3)
   deleted: (at package1 s3)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 10
4. (load-truck package2 truck1 s3)
   deleted: (at package2 s3)
   added: (in package2 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 1 of 10
5. (load-truck package6 truck1 s3)
   deleted: (at package6 s3)
   added: (in package6 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 1 of 10
6. (drive-truck truck1 s3 s5 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (fuel-used) from 110 to 286
   goals met: 1 of 10
7. (walk driver3 s6 p3-6)
   deleted: (at driver3 s6)
   added: (at driver3 p3-6)
   goals met: 1 of 10
8. (walk driver3 p3-6 s3)
   deleted: (at driver3 p3-6)
   added: (at driver3 s3)
   goals met: 1 of 10
9. (drive-truck truck1 s5 s0 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (fuel-used) from 286 to 910
   goals met: 1 of 10
10. (unload-truck package2 truck1 s0)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 2 of 10
11. (board-truck driver3 truck2 s3)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 2 of 10
12. (drive-truck truck2 s3 s5 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (fuel-used) from 910 to 1020
   goals met: 3 of 10
13. (drive-truck truck1 s0 s6 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   changed: (fuel-used) from 1020 to 1059
   goals met: 3 of 10
14. (load-truck package3 truck1 s6)
   deleted: (at package3 s6)
   added: (in package3 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 3 of 10
15. (load-truck package4 truck1 s6)
   deleted: (at package4 s6)
   added: (in package4 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 3 of 10
16. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 3 of 10
17. (board-truck driver3 truck3 s5)
   deleted: (at driver3 s5) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 10
18. (drive-truck truck3 s5 s2 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   changed: (fuel-used) from 1059 to 1549
   goals met: 3 of 10
19. (load-truck package5 truck3 s2)
   deleted: (at package5 s2)
   added: (in package5 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 3 of 10
20. (drive-truck truck3 s2 s6 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 1549 to 1868
   goals met: 3 of 10
21. (unload-truck package5 truck3 s6)
   deleted: (in package5 truck3)
   added: (at package5 s6)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 4 of 10
22. (drive-truck truck3 s6 s1 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s1)
   changed: (fuel-used) from 1868 to 2178
   goals met: 5 of 10
23. (drive-truck truck1 s6 s4 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   changed: (fuel-used) from 2178 to 3198
   goals met: 5 of 10
24. (disembark-truck driver4 truck1 s4)
   deleted: (driving driver4 truck1)
   added: (at driver4 s4) (empty truck1)
   goals met: 6 of 10
25. (unload-truck package1 truck1 s4)
   deleted: (in package1 truck1)
   added: (at package1 s4)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 7 of 10
26. (unload-truck package3 truck1 s4)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 8 of 10
27. (unload-truck package4 truck1 s4)
   deleted: (in package4 truck1)
   added: (at package4 s4)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 9 of 10
28. (unload-truck package6 truck1 s4)
   deleted: (in package6 truck1)
   added: (at package6 s4)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 9 of 10
29. (drive-truck truck3 s1 s4 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (fuel-used) from 3198 to 3378
   goals met: 8 of 10
30. (load-truck package6 truck3 s4)
   deleted: (at package6 s4)
   added: (in package6 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 8 of 10
31. (drive-truck truck3 s4 s1 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (fuel-used) from 3378 to 3576
   goals met: 9 of 10
32. (drive-truck truck3 s1 s2 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 3576 to 3708
   goals met: 8 of 10
33. (unload-truck package6 truck3 s2)
   deleted: (in package6 truck3)
   added: (at package6 s2)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 9 of 10
34. (drive-truck truck3 s2 s1 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 3708 to 3828
   goals met: 10 of 10
